Tekla Open API Reference for Tekla Structures 2025
ICurve Interface
 Interface that represents an abstract curved geometry defined by a set of points. This interface is intended to be the base class of 3D curves.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface ICurve : IEquatable<ICurve>
Public Interface ICurve
	Inherits IEquatable(Of ICurve)
The ICurve type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the curve. May be the same as StartPoint if the curve is closed.
Length
 Gets the length of the curve
StartPoint
 Gets the start point of the curve
Top
Methods
Name | Description
Clone
 Returns a deep copy of the geometry
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace